Xception-LSTM / (20 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 512)               5244928   
_________________________________________________________________
dense (Dense)                (None, 1024)              525312    
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 3075      
=================================================================
Total params: 6,822,915
Trainable params: 6,822,915
Non-trainable params: 0
_________________________________________________________________


NASNetLarge-LSTM / (20 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 1024)              20713472  
_________________________________________________________________
dense (Dense)                (None, 64)                65600     
_________________________________________________________________
dense_1 (Dense)              (None, 256)               16640     
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 771       
=================================================================
Total params: 20,796,483
Trainable params: 20,796,483
Non-trainable params: 0
_________________________________________________________________


DenseNet121-LSTM / (20 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 32)                135296    
_________________________________________________________________
dense (Dense)                (None, 1024)              33792     
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 3075      
=================================================================
Total params: 1,221,763
Trainable params: 1,221,763
Non-trainable params: 0
_________________________________________________________________


POCOVIDNet-LSTM (3) / (5 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 256)               787456    
_________________________________________________________________
dense (Dense)                (None, 128)               32896     
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 387       
=================================================================
Total params: 837,251
Trainable params: 837,251
Non-trainable params: 0
_________________________________________________________________


DenseNet201-LSTM / (5 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 1024)              12062720  
_________________________________________________________________
dense (Dense)                (None, 512)               524800    
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 387       
=================================================================
Total params: 12,653,571
Trainable params: 12,653,571
Non-trainable params: 0
_________________________________________________________________


NASNetMobile-LSTM / (15 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 64)                286976    
_________________________________________________________________
dense (Dense)                (None, 64)                4160      
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              66560     
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 3075      
=================================================================
Total params: 360,771
Trainable params: 360,771
Non-trainable params: 0
_________________________________________________________________


POCOVIDNet-LSTM (1) / (20 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 256)               787456    
_________________________________________________________________
dense (Dense)                (None, 256)               65792     
_________________________________________________________________
dense_1 (Dense)              (None, 512)               131584    
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 986,371
Trainable params: 986,371
Non-trainable params: 0
_________________________________________________________________


POCOVIDNet-LSTM (4) / (10 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 512)               2099200   
_________________________________________________________________
dense (Dense)                (None, 128)               65664     
_________________________________________________________________
dense_1 (Dense)              (None, 512)               66048     
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 2,232,451
Trainable params: 2,232,451
Non-trainable params: 0
_________________________________________________________________


ResNet152V2 / (10 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 1024)              12587008  
_________________________________________________________________
dense (Dense)                (None, 1024)              1049600   
_________________________________________________________________
dense_1 (Dense)              (None, 128)               131200    
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 387       
=================================================================
Total params: 13,768,195
Trainable params: 13,768,195
Non-trainable params: 0
_________________________________________________________________


ResNet152v2 / (20 frames)
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 512)               5244928   
_________________________________________________________________
dense (Dense)                (None, 128)               65664     
_________________________________________________________________
dense_1 (Dense)              (None, 256)               33024     
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 771       
=================================================================
Total params: 5,344,387
Trainable params: 5,344,387
Non-trainable params: 0
_________________________________________________________________
